{"Review 1": {"Date": "29 November 2018", "Text": "Started out very interesting but it's losing me. It doesn't help that Cal's mom is really starting to get on my nerves. Can't recall such a selfish character in any series recently.I REALLY wanted it to be so much more. I'll keep watching although the fire is just smoldering. After all, I'm not a quitter..."}, "Review 2": {"Date": "12 November 2018", "Text": "Now it's basically a soap box opera, overly melodramatic with very little mystery, if any. People constantly arguing is not entertaining to me."}, "Review 3": {"Date": "9 November 2018", "Text": "Started out with a new and interesting theme. Some of the acting is terrible and one of the main characters consistently looks puzzled, no matter what emotion he is supposed to be portraying. Getting past his annoyingly horrific on screen persona is very problematic as he is so unbelievable when he is mad or sad or happy....he just always looks dumbfounded, sort of like a deer in headlights and it is very distracting from the plot.They need to pick up the pace of this because it is starting to DRAG with very boringly predictable plot lines of the government vs them.It has a LOT of potential and I would hate to see it canceled before the big reveal."}, "Review 4": {"Date": "27 October 2018", "Text": "Like most supernatural dramas on network television, this one is high on concept and low on story. This is turning into This is Us weepy relationship schmaltz."}, "Review 5": {"Date": "7 November 2018", "Text": "Meh. Another typical show where the creators clearly woke up with an idea for half of their story, successfully pitched it, and will now make it up as they go along. These types of shows are all very similar in that they are very slow to develop due to the lack of a thoroughly flushed out storyline. Because of this, the show lacks necessary intrigue and the occasional efforts to drop in an mysterious omnidirectional subplot leaves the viewer disinterested."}, "Review 6": {"Date": "25 September 2018", "Text": "I'm not one to watch a network show like this, but my mom wanted to watch it so i figured why not. the personal storylines are cheesy and predictable, but the overall arc of this story is interesting. i am curious as to what happened on the plane. i'd watch the show to see what unravels, but this isn't some life changing television."}, "Review 7": {"Date": "25 September 2018", "Text": "Much more of a CSI than a SciFi. I have seen most of the story lines before as far back as the Twilight Zone and One Step Beyond with XFiles and Lost thrown in. The cast is solid and the story possibilities are intriguing. For the passengers a 3 hour flight with a few frightening minutes of unexplained turbulence has left them displaced in time. For the friends and family they have rejoined, 5 and 1/2 years have elapsed and thinking their loved ones dead most have moved on with their lives. There is also a 5 and a 1/2 year age gap to contend with. The government sees the people as a possible threats. The scientific community sees them as lab specimens to be intricately studied and tested The story lines are almost endless. Lets hope the plot doesn't bog down on person or situation. As I said this series has possibilities. Lets hope it lives up to them!"}, "Review 8": {"Date": "25 September 2018", "Text": "I was very hopeful when I saw the previews for this program. I wasn't, however, hoping for such a focus on the sci-fi (or whatever you want to call it) aspects. Like others said, this is reminiscence of a Lost or similar program in reverse. I had hoped this program would focus mainly on stories of the passengers integrating back into their old lives, dealing with all the changes that had taken place in those five and half years. The focus seems split more than I'd like it to be, although, let's be honest - if this had happened in real life, we can be sure the authorities, the scientists, and everyone else would be following their every move until an answer was found.That said, I disagree with some who claim the acting is lackluster. The acting is low key and subdued, just the way most real people live. If the actors were overly dramatic, it would change the thrust. This is low key real life behavior or people who are supposed to be genuinely confused. In that regard, I think the acting is fine.All pilot episodes have to accomplish a lot - they have to capture the attention of scores of people, all with different interests. I suspect better is yet to come. Many shows are discarded by folks before the programs are ever given a chance to develop, one way or another. I intend to watch this program for at least a few more times. If it goes downhill, that will be it. However, I think it has good potential to last for at least a few seasons and keep us interested."}, "Review 9": {"Date": "25 September 2018", "Text": "Interesting premise, but not great acting and kind of cheesy production so far. Will probably give it a chance for a couple of episodes more..."}, "Review 10": {"Date": "9 October 2018", "Text": "I thought this would be a decent show. The first episode held my interest, but the next two it just started getting bad. Melissa Roxburgh is a terrible actress. She's not at all convincing as a cop. I usually give new shows three views before deciding to stay. Sorry Manifest, but you struck out. If I want shlocky TV, SyFy beats this. Bye."}, "Review 11": {"Date": "22 October 2018", "Text": "I feared it from the pilot; again a network tries to find a series with a slow burning plot that can lead to anywhere or nowhere, but with some action and something \"to solve\" every episode, hoping it will once again score like the Lost series.\nBut despite the good actors the script fails and doesn't compel you. No pause needed when you get something from the fridge or take a leak, just ask the other one in the room if anything happened, the answer shall be: \"nothing special, I guess, I wasn't even quite following, I was making a grocery list for tomorrow in my head.\"\nIf you want something playing on the background that's not irritating, this series will do. But if you wanna be entertained, it fails.\nNormally I would rate a series like this 5, but I give it a 4 because of wasted talent and money."}, "Review 12": {"Date": "27 September 2018", "Text": "They didn't build up for anything, they just jumped on to the plot, so we didn't feel anything when we should've. They could have built something up for the first 35 mins and then they could've given the ''big news'' with a cliffhanger. But f#ck that, we don't need any emotion or any feeling, we just have to impress the audience with a narrator and an interesting idea. Well, no. They are not even trying to be smart with this beautiful idea. Everything was just casual. Executions were bad too but I don't want to get into that because I don't want to waste my time and spoil everything.In a nutshell, good idea, but poorly executed and not so much thought put into it. I don't believe they'll do with this kind of production but I hope they raise the bar in the future.If you're desperate for a show, I'll recommend ''Bodyguard'' it's gripping and make sense. The final episode was kind of a let down compared to the first 5 episode but I'd rewatch that show rather than watching this show."}, "Review 13": {"Date": "27 November 2018", "Text": "I listened to a podcast years ago about how good movie scripts are tested. A company of script editors whose only purpose for existence is to make sure people behave the way a real person would. This company is badly needed in this show. Characters react only to maximise the drama, not because they are real people.If this gets to season two, I won't be watching."}, "Review 14": {"Date": "20 November 2018", "Text": "It had some potential, and I mean very little. It had a low bar to hurdle and it tripped on the first step. Acting sucks, story is bland, every episode they keep adding in a new way to extend the story. I won't shead a tear when it gets cancelled."}, "Review 15": {"Date": "14 November 2018", "Text": "Really liked the beginnings and I had a lot of promise...until. Until I realized the producers must have been recruited from The Bold and the Beautiful or Greys Anatomy. It's basically a soap opera body with sci fi legs on it. I get the odd feeling they are gonna get dropped after season 1"}, "Review 16": {"Date": "25 October 2018", "Text": "This show is cheesy.\nIt feels unnaturally PC and completely false.They failed to engender any interest in the cast, indeed i really could not care less about any of them, the cheesy voice overs and wooden acting make this an almost immediate turn off.\nPity as this could have been an intriguing show.\nProducers need to be more careful about who they put in charge."}, "Review 17": {"Date": "12 October 2018", "Text": "Lost was probably my favorite series of all-time. The mystery surrounding the storyline is certainly intriguing for sure. However, the characters are a little uninteresting so far. Also, the writing is pretty subpar too. I can only hope it starts picking up from here."}, "Review 18": {"Date": "13 October 2018", "Text": "I only watched the first two episodes of \"Manifest\" before I bowed out due to boredom and being thoroughly unimpressed. As such, I obviously can't say whether this is going to be a hit or not. Here's what I can say with reasonable certainty, however: \"Manifest\" is a pretty standard-issue network show trying to skate by on concept.The setup is incredible: a plane takes off, experiences turbulence, and then seemingly lands successfully. The catch? On the ground, 5 years have passed, while the passengers on the plane have only experienced the flight time. There are so many interesting ways this story could go...but of course it's a network show, so none of them are able to be adequately explored.No, unfortunately that intriguing setup is quickly pushed aside to follow passengers hearing voices guiding them to complete certain tasks. I can also guarantee how this will play out: little details about what we all want (the plane mystery) will be parceled out extremely slowly, and a big revelation will come at the very end if the full season order gets picked up.To its credit, the show does try to delve into the family dynamics this odd scenario sets up, but sadly none of the acting stands out and all the actors are remarkably bland (sometimes enough so that I had trouble telling them apart or remembering why they were important).Is the concept the writers are cooking up truly good? Maybe, maybe not. But I would argue it may not even matter because the journey towards that discovery will be so ponderous.\"Manifest\" is the kind of show that had a good chance to catch on in the 80s or 90s, or for those who watch TV drama much more casually in terms of overall investment. However, many viewers are now spoiled by the cable or streaming dramas that now dominant the genre, and are all-around superior in acting, production value, writing, pacing, etc. If the \"Manifest\" concept premiered on one of those services, it would immediately jump into \"the good stuff\" instead of having to appeal to a wide base, test the waters, parcel things out, wait for a pickup, etc.Bottom line: I'm spoiled when it comes to TV dramas, and now (more than every) extremely leery of any network fare. While that may be sad in certain aspects, at the same time it is also just a fact of the business at this point."}, "Review 19": {"Date": "25 September 2018", "Text": "Interesting storyline, but like the TV show Lost, I wonder where it will go and how it will explain five and a half years missing. Lost was good in the beginning, but I slowly lost interest as it just became ridiculous to believe in. I'll give it a few more weeks, I really hope it surprises me"}, "Review 20": {"Date": "5 November 2018", "Text": "My wife and I don't watch too many network programs, but we thought the concept of this one sounded interesting, and we figured that with Zemekis behind it, the production values would be pretty high.I have a three episode rule for new shows. Sometimes it's not fair to rush to judgement, as they're still finding their voice. We lasted two and a half episodes with Manifest.First, the writing is just bad. Cliched characters, forced dialogue. The natural comparison is to Lost. Well, in Lost, they would leave you confused, giving you clues, sometimes making you think one thing was going on, when it was really something else. Introducing you to new characters and sub plots piecemeal, as the story moved forward. They didn't hand you anything. Brilliant.Manifest, however spent the whole first episode introducing you to every character. Hitting hard all the points they wanted you to take away so there was no room left for any nuance or interpretation. I hate these shows that spoonfeed you. If shows they have no faith in their audience.The acting is beyond wooden. Pick any girl from any High School play, and she'll do a better job than the female lead who plays the cop, mumbling her way expressionlessly through her dialogue. All the actors are about the same calibre as the crime witnesses in a typical Law and Order episode.Finally, the special effects are about like Magruber on SNL. This was the guy who brought us Forest Gump and Who Framed Roger Rabbit? 30 years ago Zemekis was known as a special effects maven. Not sure what happened."}, "Review 21": {"Date": "26 September 2018", "Text": "If this ever did happen and public were told about it, it would be one of the greatest/unbelievable events in human history. Instead, it is met with mild skepticism, and life goes on as usual. Good looking cast can not save this sophomoric effort and I would be surprised, if this makes it to a second season."}, "Review 22": {"Date": "3 October 2018", "Text": "It felt Rushed, they jumped right at it.\nthe pilot alone has the potential of 3 episodes, \non another Network like HBO (big production), we could've seen a great interesting show.\nbut still want to know what's next."}, "Review 23": {"Date": "28 September 2018", "Text": "I think the premise is interesting, not sure how much sci-fi will come out of it, I think that will make or break the show. I'd like for it to be a little more realistic. It reminds me of 'Under the Dome' before the twist came out and *under the dome spoiler* it was about aliens... and became dumb and then sadly canceled. Hopefully, Manifest doesn't follow suit."}, "Review 24": {"Date": "25 September 2018", "Text": "Really enjoying the Pilot, I'm hoping that NBC gives it a good chance to catch on and survive"}, "Review 25": {"Date": "25 September 2018", "Text": "The commercials made me curious so I tuned in for the first episode and was not disappointed. While the very beginning seemed a bit confusing (family drama with no explanations or backstory will do that) I quickly forgot about that with all the action that followed. I watched the episode with my mom and was constantly wondering things out loud, pondering what could be going on and possible explanations for the airplane's 5-year disappearance, and to me that's the mark of a good show. One that makes you think, one that gets you interested enough that you try to come up with your own theories. The end of the episode was that kind of 'ohhh!' situation that makes me excited to tune in next week to learn more. I feel like they could take this premise in so many different ways and I'm very curious to see where the writers go with it."}}